{
  "Index": 10,
  "Code": "MacroDelay_Tutorial",
  "Name": "Macro Delay Tutorial",
  "Commands": [
    "Welcome to this video outlining what Macro Delay is. Today I'll be showing you what it does and why I bothered making it at all.",
    ".mdelay 2800",
    "It's important to note that for chat messages there is a 1 second delay requirement to prevent being rate limited by the server (or even in singleplayer, like here.)",
    ".mdelay 2800",
    "However, it's not exactly 1000ms, which is a little irksome for development of macros that use the chat functionality.",
    ".mdelay 1900",
    "For example, if I were to add a line without any delay and it uses the chat box, we'll be rate limited like this:",
    "This can't be seen because of rate limiting!",
    ".mdelay 2800",
    "So I like to use a clean .delay 2800 to give it just a little bit of extra padding.",
    ".mdelay 2800",
    "This macro delay functionality can be used to call lines of your macro over a longer period of time...",
    ".mdelay 4000",
    "Just like that by adding .mdelay 4000 to your macro.",
    ".mdelay 2800",
    "If you're editing the JSON, it becomes a lot easier to write on multiple lines because you can use a text editor you enjoy.",
    ".mdelay 2800",
    "or notepad.exe :^)",
    ".mdelay 2800",
    "What we can do with this is everything we did before in macros, but now we can cause things to be delayed.",
    ".mdelay 2800",
    "This allows us to write much longer macros (Linux users currently cannot write very very long single line macros, so open the macro JSON and edit manually).",
    ".mdelay 3200",
    "We don't have to wait for commands that don't post to chat, of course.",
    ".waypoint list",
    ".waypoint add blue Our new waypoint",
    ".mdelay 2800",
    "Macro recursion exists, as well! You can run .mdrepeat at the end of your function in order to re-run the same macro.",
    ".mdelay 2800",
    "This would mean that you can setup a macro to run .online every 5 minutes, or take a screenshot every 20.",
    ".mdelay 2800",
    "Or even as this example I'm about to show you will make clear, that you can drop a candy trail on your map.",
    ".mdelay 2800",
    "Starting the waypoint macro........",
    ".mdrun 11",
    ".mdelay 10000",
    ".mdstop 11",
    "The possibilities are pretty outstanding, if I do say so myself.",
    ".mdelay 2800",
    "Anyway, here's the entire bee movie script to showcase what setting the global delay does.",
    ".mdelay 2800",
    "Basically, you can .mdrun (macro_id) (delay between calls in ms)",
    ".mdelay 2800",
    "Which runs the first command at 0 seconds and then every call after has that delay. So without further delay,",
    ".mdelay 5000",
    "Here is some of tge bee movie script from my 9th macro.",
    ".mdrun 9 4000",
    ".mdstop 10"
  ],
  "KeyCombination": null
}